In [2]:
import pandas as pd 
import numpy as np

CREATING DATAFRAMES

In [3]:
#Making dataframe with Dictionary
data = {
    'Name': ['Rahul', 'Neha', 'Aman', 'Priya'],
    'Age': [25, 28, 24, 27],
    'City': ['Mumbai', 'Bengaluru', 'Pune', 'Hyderabad'],
    'Salary': [45000, 52000, 48000, 60000]
}
dF= pd.DataFrame(data)
dF

    Name  Age       City  Salary
0  Rahul   25     Mumbai   45000
1   Neha   28  Bengaluru   52000
2   Aman   24       Pune   48000
3  Priya   27  Hyderabad   60000

In [4]:
#Making dataframe with lists
data_list = [
    ['Karan', 30, 'Chennai', 70000],
    ['Anjali', 26, 'Jaipur', 42000],
    ['Rohit', 35, 'Ahmedabad', 85000],
    ['Sneha', 29, 'Indore', 50000]
]
dF2=pd.DataFrame(data_list)
#dF (This will print dataframe with  0 1 2 3 cols and so on)
# to insert cols in dataframe 
columns = ['Name', 'Age', 'City', 'Salary']
dF2= pd.DataFrame(data_list, columns=columns)
dF2

     Name  Age       City  Salary
0   Karan   30    Chennai   70000
1  Anjali   26     Jaipur   42000
2   Rohit   35  Ahmedabad   85000
3   Sneha   29     Indore   50000

Selection and Indexing of Coloums

In [5]:
dF2

     Name  Age       City  Salary
0   Karan   30    Chennai   70000
1  Anjali   26     Jaipur   42000
2   Rohit   35  Ahmedabad   85000
3   Sneha   29     Indore   50000

In [6]:
#We can select column in DataFrame by 
dF2['Name']

0     Karan
1    Anjali
2     Rohit
3     Sneha
Name: Name, dtype: object

In [7]:
# We can also fetch multiple column
dF2[["Name", "City"]]

     Name       City
0   Karan    Chennai
1  Anjali     Jaipur
2   Rohit  Ahmedabad
3   Sneha     Indore

Creating a new column

In [9]:
dF2["Designation"]=["Doctor", "Engineer", 'Painter', 'Mechanic']

In [10]:
dF2

     Name  Age       City  Salary Designation
0   Karan   30    Chennai   70000      Doctor
1  Anjali   26     Jaipur   42000    Engineer
2   Rohit   35  Ahmedabad   85000     Painter
3   Sneha   29     Indore   50000    Mechanic

Removing Columns

In [12]:
dF2

     Name  Age       City  Salary Designation
0   Karan   30    Chennai   70000      Doctor
1  Anjali   26     Jaipur   42000    Engineer
2   Rohit   35  Ahmedabad   85000     Painter
3   Sneha   29     Indore   50000    Mechanic

In [13]:
dF2.drop(["Designation"], axis=1)

     Name  Age       City  Salary
0   Karan   30    Chennai   70000
1  Anjali   26     Jaipur   42000
2   Rohit   35  Ahmedabad   85000
3   Sneha   29     Indore   50000

In [14]:
dF2

     Name  Age       City  Salary Designation
0   Karan   30    Chennai   70000      Doctor
1  Anjali   26     Jaipur   42000    Engineer
2   Rohit   35  Ahmedabad   85000     Painter
3   Sneha   29     Indore   50000    Mechanic

In [17]:
#After dropping i mean deleteing we can still see the Designation column in the Dataframe how to overcome this?
#We can overcome this by using inplace 
dF2.drop(["Designation"], axis=1, inplace=True)

In [18]:
dF2

     Name  Age       City  Salary
0   Karan   30    Chennai   70000
1  Anjali   26     Jaipur   42000
2   Rohit   35  Ahmedabad   85000
3   Sneha   29     Indore   50000

In [19]:
dF.drop(0, axis=0)

    Name  Age       City  Salary
1   Neha   28  Bengaluru   52000
2   Aman   24       Pune   48000
3  Priya   27  Hyderabad   60000

Selecting rows in Dataframe

In [20]:
dF2

     Name  Age       City  Salary
0   Karan   30    Chennai   70000
1  Anjali   26     Jaipur   42000
2   Rohit   35  Ahmedabad   85000
3   Sneha   29     Indore   50000

In [23]:
dF2.loc[0]

Name        Karan
Age            30
City      Chennai
Salary      70000
Name: 0, dtype: object

In [27]:
#We can also select mulitple locations
dF2.loc[[0,2]]

    Name  Age       City  Salary
0  Karan   30    Chennai   70000
2  Rohit   35  Ahmedabad   85000

Selecting subset of rows and columns

In [29]:
dF2

     Name  Age       City  Salary
0   Karan   30    Chennai   70000
1  Anjali   26     Jaipur   42000
2   Rohit   35  Ahmedabad   85000
3   Sneha   29     Indore   50000

In [32]:
dF2.loc[[0,1],['City','Salary']]

      City  Salary
0  Chennai   70000
1   Jaipur   42000

In [33]:
dF2.loc[[2,3],['Name','Age']]

    Name  Age
2  Rohit   35
3  Sneha   29

Conditional Selection

In [35]:
dF2

     Name  Age       City  Salary
0   Karan   30    Chennai   70000
1  Anjali   26     Jaipur   42000
2   Rohit   35  Ahmedabad   85000
3   Sneha   29     Indore   50000

TypeError: '>' not supported between instances of 'str' and 'int'